## Operations

In [ ]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})

In [5]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [7]:
len(df['col2'].unique())

3

In [8]:
df['col2'].nunique()

3

In [15]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

## Apply Method

In [17]:
def times2(x):
    return x*2

In [18]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [22]:
df['col3'].apply(lambda var:var.upper())

0    ABC
1    DEF
2    GHI
3    XYZ
Name: col3, dtype: object

In [24]:
df.drop(0, axis=0)

   col1  col2 col3
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [25]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [27]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [30]:
df.sort_values(by='col2',axis=0)

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [31]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [32]:
df.pivot_table(values='col2', index='col1', columns='col3')

col3    abc    def    ghi    xyz
col1
1     444.0    NaN    NaN    NaN
2       NaN  555.0    NaN    NaN
3       NaN    NaN  666.0    NaN
4       NaN    NaN    NaN  444.0